### Terraform Plan Output

```

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_lambda_layer_version.requests_layer has been deleted
  - resource "aws_lambda_layer_version" "requests_layer" {
      - arn                         = "arn:aws:lambda:us-east-1:218278578731:layer:requests-layer:4" -> null
        id                          = "arn:aws:lambda:us-east-1:218278578731:layer:requests-layer:4"
        # (16 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.create_order_function will be updated in-place
  ~ resource "aws_lambda_function" "create_order_function" {
        id                             = "create-order-function"
      ~ last_modified                  = "2025-11-28T18:42:09.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:218278578731:layer:requests-layer:7",
        ] -> (known after apply)
      ~ source_code_hash               = "qYaQhPYtqe1tiQykbE8Yn/OCTQckI5vuZ+FP5ZtYh8c=" -> "PT2/kDTUGTey2oOGvD9atSYXfmMBopYODqLwcLTkrrM="
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.scheduled_status_update_function will be updated in-place
  ~ resource "aws_lambda_function" "scheduled_status_update_function" {
        id                             = "scheduled-status-update-function"
      ~ last_modified                  = "2025-11-28T18:42:03.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:218278578731:layer:requests-layer:7",
        ] -> (known after apply)
      ~ source_code_hash               = "t417sqVUu+r0j6MN+EcpyMu7GrawXSTNRVQvmKwX8bQ=" -> "HSy4vGLgEPLvOuoFq+NIJZ32UGuZNNFHZoY8sq0QOvU="
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.station_migration will be updated in-place
  ~ resource "aws_lambda_function" "station_migration" {
        id                             = "station_migration"
      ~ last_modified                  = "2025-11-28T18:42:09.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:218278578731:layer:requests-layer:7",
        ] -> (known after apply)
      ~ source_code_hash               = "cj7lJv6byIUy9mOaKd1DbF59krVnHiF54CdGiWTWbCE=" -> "2CpP5MjBy9Mq2k84NkJNLJy7+0r2N3OqMS9UwkU7Lvg="
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.upload_avatar_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_avatar_function" {
        id                             = "upload-avatar-function"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:218278578731:layer:requests-layer:7",
        ] -> (known after apply)
        tags                           = {}
        # (30 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.requests_layer will be created
  + resource "aws_lambda_layer_version" "requests_layer" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.10",
          + "python3.11",
          + "python3.9",
        ]
      + created_date                = (known after apply)
      + description                 = "Layer containing requests library for Python"
      + filename                    = "requests_layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "requests-layer"
      + region                      = "us-east-1"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "JR6XzaipcT7wT01m9mHwdAh4V5CUyo2LBKJ8Z8ApUQY="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

Plan: 1 to add, 4 to change, 0 to destroy.
```
